snlkuharlocal/src/DataProcessors/ПерезаполнениеРаспродажиИМ/ПерезаполнениеРаспродажиИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПерезаполнениеРаспродажиИМ</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/РаспродажаИМ/РаспродажаИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспродажаИМ</name>
  <registerRecords>InformationRegister.СкидкиНоменклатурыКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Распродажа</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнетМагазины</name>
    <attributes>
      <name>ИнетМагазин</name>
      <type>
        <types>CatalogRef.ИнетМагазины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ХитыИМ/ХитыИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ХитыИМ</name>
  <registerRecords>InformationRegister.СкидкиНоменклатурыКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Хиты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнетМагазины</name>
    <attributes>
      <name>ИнетМагазин</name>
      <type>
        <types>CatalogRef.ИнетМагазины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/Новинки/Новинки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Новинки</name>
  <registerRecords>InformationRegister.СкидкиНоменклатурыКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Новинки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнетМагазины</name>
    <attributes>
      <name>ИнетМагазин</name>
      <type>
        <types>CatalogRef.ИнетМагазины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ПерезаполнениеРаспродажиИМ/ObjectModule.bsl
Перем МассивУзлов, МассивУзловБ2б экспорт;
Перем ДокументРаспродажи Экспорт;

// стильпарк
Процедура ЗарегистроватьИзменениеПланаОбмена(Ном)
	
	выгружать =  ПРоцедурыОБменаССайтом.ВыгружатьНаСайтСтильпарк(Ном);
	Если Выгружать = "Да" Тогда
		
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Ном.ссылка);
			//сообщить(ном);
		Исключение 
		конецПопытки;
		
	КонецЕсли;


КонецПроцедуры	


Процедура ЗарегистроватьИзменениеПланаОбменаБ2б(Ном)
	// для б2б                                               // стильпарк = ложь
	выгружать =  ПРоцедурыОБменаССайтом.ВыгружатьНаСайт(Ном, ложь) ;
	
	Если Выгружать = "Да" Тогда
		
		Попытка                                    // в узлы для б2б пишем 
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловб2б, Ном.ссылка);
			//сообщить(ном);
		Исключение 
		конецПопытки;
		
	КонецЕсли;


КонецПроцедуры	


Процедура ПередачаИзмененийВчерашнегоДня () экспорт
	
	// для документа все, что было вчера перенесем на перевыгрузку.
	//состояние("Передача изменений вчерашнего дня");
	попытка
		ДокументРаспр = ДокументРаспродажи; //документы.РаспродажаИМ.НайтиПоНомеру("SNL-00002");
	исключение
		возврат;
	конецПопытки;	
	
	//	временно заблокировать
	
	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ТекСтрокаСоединения=СтрокаСоединенияСразрешеннымОбменом Тогда
	Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза()  Тогда
		//Кухарь А.Ю. 31.03.2026 конец
			
		Для каждого текстр из ДокументРаспр.Распродажа цикл
			
			Ном = текстр.номенклатура.ссылка;
			выгружать =  ПроцедурыОБменаССайтом.ВыгружатьНаСайтСтильпарк(Ном);
			Если Выгружать = "Нет" ТОгда
				продолжить;
			КонецЕсли;	
			ЗарегистроватьИзменениеПланаОбмена(Ном);
			
		конецЦикла;	
		
	КонецЕсли;

	
	
КонецПроцедуры	


Процедура ПолучитьДокументРаспродажи()
	
	ДокументРаспродажи = неопределено;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РаспродажаИМИнетМагазины.Ссылка КАК Ссылка,
	               |	РаспродажаИМИнетМагазины.ИнетМагазин КАК ИнетМагазин
	               |ИЗ
	               |	Документ.РаспродажаИМ.ИнетМагазины КАК РаспродажаИМИнетМагазины
	               |ГДЕ
	               |	РаспродажаИМИнетМагазины.Ссылка.ПометкаУдаления = ложь
	               |	И РаспродажаИМИнетМагазины.ИнетМагазин.Ссылка = &стильпарк";

	  запрос.УстановитьПараметр("стильпарк",справочники.ИнетМагазины.НайтиПоКоду("00008")); // стильпарк
	  Рез = запрос.Выполнить().Выбрать();
	  Если Рез.Следующий() Тогда
		  ДокументРаспродажи = рез.ссылка;
	  КонецЕсли;	  
	
КонецПроцедуры	

Процедура ПерезаписьРаспродажи()
		
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Модель,
	               |	ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
	               |	ЦеныНоменклатурыСрезПоследних.Прайс.Дата КАК ДатаПрайса,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ПОМЕСТИТЬ Цены
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			{(&Дата2)},
	               |			Прайс.Проведен
	               |				И Прайс.Дата2 >= &Дата2) КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.ТипЦен В ИЕРАРХИИ(&ТипЦен)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Модель,
	               |	ТипЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(Цены.ДатаПрайса) КАК ДатаПрайса,
	               |	Цены.Модель КАК Модель,
	               |	Цены.ТипЦен КАК ТипЦен
	               |ПОМЕСТИТЬ Прайсы
	               |ИЗ
	               |	Цены КАК Цены
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Цены.ТипЦен,
	               |	Цены.Модель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	""Цены"" КАК Раздел,
	               |	Прайсы.Модель КАК Модель
	               |ИЗ
	               |	Прайсы КАК Прайсы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	               |		ПО (Цены.Модель = Прайсы.Модель)
	               |			И (Цены.ТипЦен = Прайсы.ТипЦен)
	               |			И (Цены.ДатаПрайса = Прайсы.ДатаПрайса)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад В ИЕРАРХИИ (&склад)) КАК ОстаткиТМЦОстатки
	               |		ПО Прайсы.Модель = ОстаткиТМЦОстатки.Номенклатура.Родитель
	               |ГДЕ
	               |	ОстаткиТМЦОстатки.КоличествоОстаток > &нуль";
	
	
	пп = 0;
	типыцен = новый массив;
	типыцен.Добавить(справочники.ТипыЦен.НайтиПоКоду("SNL-1638")); //дисконт
	типыцен.Добавить(справочники.ТипыЦен.НайтиПоКоду("SNL-1635"));
	
	Склад = справочники.Склады.НайтиПоКоду("STD-06"); // дисконт
	запрос.УстановитьПараметр("Дата2", Конецдня(ТекущаяДата()));
	запрос.УстановитьПараметр("нуль", пп);
	запрос.УстановитьПараметр("склад", склад);
	запрос.УстановитьПараметр("ТипЦен", типыцен);
	
	Рез = Запрос.Выполнить().Выгрузить();
	попытка
		ДокументРаспр = ДокументРаспродажи.получитьОбъект(); //документы.РаспродажаИМ.НайтиПоНомеру("SNL-00002").ПолучитьОбъект();
	исключение
		возврат;
	конецПопытки;	
	
		
	ДокументРаспр.дата = текущаядата();
	ДокументРаспр.началоПериода = НачалоДня(текущаядата());
	ДокументРаспр.Распродажа.Очистить();
	
	Для каждого текстр из рез цикл
		
		
		выгружать =  ПроцедурыОБменаССайтом.ВыгружатьНаСайтСтильпарк(текстр.модель);
		Если Выгружать = "Нет" ТОгда
			продолжить;
		КонецЕсли;	

		НовСтр = ДокументРаспр.Распродажа.Добавить();
		НовСтр.Номенклатура = текстр.модель;
		
		ЗарегистроватьИзменениеПланаОбмена(текстр.модель);
	
	конецЦикла;	
	
	 ДокументРаспр.Записать();
	
	
КонецПроцедуры	



//-----------------------------------------------------------
// НОВИНКИ для сайта стильпарк и б2б
//нечаева 17,01,2023 +++

Процедура ОбработкаХитовПоСайтам() Экспорт
	
	
	//  стильпарк ----------------------------------------------------------------
	Сайтстильпарк = справочники.ИнетМагазины.НайтиПоКоду("00008");
	
	СнятиеРегистрацииХитовНаСайте(Сайтстильпарк);
	ПроверкаХитовНаСайте(Сайтстильпарк);

	//  б2б -------------------------------------------------------------------------
	СайтБ2б = справочники.ИнетМагазины.НайтиПоКоду("00007");

	СнятиеРегистрацииХитовНаСайте(СайтБ2б);
	ПроверкаХитовНаСайте(СайтБ2б);

	
КонецПроцедуры	


Процедура СнятиеРегистрацииХитовНаСайте(Сайт=неопределено)
	
	// для новинок, по которым закончился срок действия.
	
	ТЗНовинок= неопределено;	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РаспродажаТовары.Номенклатура КАК Номенклатура,
	               |	РаспродажаИМИнетМагазины.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ХитыИМ.Хиты КАК РаспродажаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ХитыИМ.ИнетМагазины КАК РаспродажаИМИнетМагазины
	               |		ПО РаспродажаТовары.Ссылка = РаспродажаИМИнетМагазины.Ссылка
	               |ГДЕ
	               |	РаспродажаТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И РаспродажаТовары.Ссылка.КонецПериода >= &Дата1
	               |	И РаспродажаТовары.Ссылка.КонецПериода < &дата2
	               |	И РаспродажаИМИнетМагазины.ИнетМагазин.Ссылка = &стильпарк";
	
	
	запрос.УстановитьПараметр("стильпарк",Сайт); // стильпарк
	дата2 = НачалоДня(ТекущаяДата());
	запрос.УстановитьПараметр("дата2",дата2);
	запрос.УстановитьПараметр("дата1",(дата2)-3*24*60*60); // смотрим документы , которые закончились 3 дня назад.
	Рез = запрос.Выполнить().выгрузить();
	
	Для каждого текстр из рез цикл
		
		Если 	Сайт.код =  "00008" Тогда
			ЗарегистроватьИзменениеПланаОбмена(текстр.номенклатура);  // перевыгрузится информация с текущими значениями, что уже не новинка.
		иначеЕсли Сайт.код =  "00007" Тогда
			ЗарегистроватьИзменениеПланаОбменаБ2б(текстр.номенклатура);  // перевыгрузится информация с текущими значениями, что уже не новинка.
		конецЕсли;	
			
	КонецЦикла;	

	
КонецПроцедуры

// проверим, добавим в план обмена действующие новинки
Процедура ПроверкаХитовНаСайте(Сайт=неопределено)
	
	
	ТЗНовинок= неопределено;	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ различные
	|	НовинкиНовинки.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ХитыИМ.Хиты КАК НовинкиНовинки
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.ХитыИМ.ИнетМагазины КАК НовинкиИнетМагазины
	|		ПО НовинкиНовинки.Ссылка = НовинкиИнетМагазины.Ссылка
	|ГДЕ
	|	НовинкиИнетМагазины.ИнетМагазин = &стильпарк
	|	И НовинкиНовинки.Ссылка.ПометкаУдаления = ложь
	|	И НовинкиНовинки.Ссылка.КонецПериода >= &дата2";
	
	запрос.УстановитьПараметр("стильпарк",Сайт); // стильпарк
	дата2 = НачалоДня(ТекущаяДата());
	запрос.УстановитьПараметр("дата2",дата2);
	
	Рез = запрос.Выполнить().выгрузить();
	
	Для каждого текстр из рез цикл
		//ЗарегистроватьИзменениеПланаОбмена(текстр.номенклатура);
		Если 	Сайт.код =  "00008" Тогда
			ЗарегистроватьИзменениеПланаОбмена(текстр.номенклатура);  // перевыгрузится информация с текущими значениями, что уже не новинка.
		иначеЕсли Сайт.код =  "00007" Тогда
			ЗарегистроватьИзменениеПланаОбменаБ2б(текстр.номенклатура);  // перевыгрузится информация с текущими значениями, что уже не новинка.
		конецЕсли;	

	конецЦикла;	
	

КонецПроцедуры
// нечаева 17,01,2023---


//-----------------------------------------------------------
// НОВИНКИ для сайта стильпарк и б2б
//нечаева 15,11,2022 +++

Процедура ОбработкаНовинокПоСайтам() Экспорт
	
	
	//  стильпарк ----------------------------------------------------------------
	Сайтстильпарк = справочники.ИнетМагазины.НайтиПоКоду("00008");
	
	СнятиеРегистрацииНовинокНаСайте(Сайтстильпарк);
	ПроверкаНовинокНаСайте(Сайтстильпарк);

	//  б2б -------------------------------------------------------------------------
	СайтБ2б = справочники.ИнетМагазины.НайтиПоКоду("00007");

	СнятиеРегистрацииНовинокНаСайте(СайтБ2б);
	ПроверкаНовинокНаСайте(СайтБ2б);

	
КонецПроцедуры	


Процедура СнятиеРегистрацииНовинокНаСайте(Сайт=неопределено)
	
	// для новинок, по которым закончился срок действия.
	
	ТЗНовинок= неопределено;	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РаспродажаТовары.Номенклатура КАК Номенклатура,
	               |	РаспродажаИМИнетМагазины.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Новинки.Новинки КАК РаспродажаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Новинки.ИнетМагазины КАК РаспродажаИМИнетМагазины
	               |		ПО РаспродажаТовары.Ссылка = РаспродажаИМИнетМагазины.Ссылка
	               |ГДЕ
	               |	РаспродажаТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И РаспродажаТовары.Ссылка.КонецПериода >= &Дата1
	               |	И РаспродажаТовары.Ссылка.КонецПериода < &дата2
	               |	И РаспродажаИМИнетМагазины.ИнетМагазин.Ссылка = &стильпарк";
	
	
	запрос.УстановитьПараметр("стильпарк",Сайт); // стильпарк
	дата2 = НачалоДня(ТекущаяДата());
	запрос.УстановитьПараметр("дата2",дата2);
	запрос.УстановитьПараметр("дата1",(дата2)-3*24*60*60); // смотрим документы , которые закончились 3 дня назад.
	Рез = запрос.Выполнить().выгрузить();
	
	Для каждого текстр из рез цикл
		
		Если 	Сайт.код =  "00008" Тогда
			ЗарегистроватьИзменениеПланаОбмена(текстр.номенклатура);  // перевыгрузится информация с текущими значениями, что уже не новинка.
		иначеЕсли Сайт.код =  "00007" Тогда
			ЗарегистроватьИзменениеПланаОбменаБ2б(текстр.номенклатура);  // перевыгрузится информация с текущими значениями, что уже не новинка.
		конецЕсли;	
			
	КонецЦикла;	

	
КонецПроцедуры

// проверим, добавим в план обмена действующие новинки
Процедура ПроверкаНовинокНаСайте(Сайт=неопределено)
	
	
	ТЗНовинок= неопределено;	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ различные
	|	НовинкиНовинки.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.Новинки.Новинки КАК НовинкиНовинки
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Новинки.ИнетМагазины КАК НовинкиИнетМагазины
	|		ПО НовинкиНовинки.Ссылка = НовинкиИнетМагазины.Ссылка
	|ГДЕ
	|	НовинкиИнетМагазины.ИнетМагазин = &стильпарк
//	|	//И НовинкиНовинки.Ссылка.НачалоПериода <= &дата2
	|	И НовинкиНовинки.Ссылка.ПометкаУдаления = ложь
	|	И НовинкиНовинки.Ссылка.КонецПериода >= &дата2";
	
	запрос.УстановитьПараметр("стильпарк",Сайт); // стильпарк
	дата2 = НачалоДня(ТекущаяДата());
	запрос.УстановитьПараметр("дата2",дата2);
	
	Рез = запрос.Выполнить().выгрузить();
	
	Для каждого текстр из рез цикл
		//ЗарегистроватьИзменениеПланаОбмена(текстр.номенклатура);
		Если 	Сайт.код =  "00008" Тогда
			ЗарегистроватьИзменениеПланаОбмена(текстр.номенклатура);  // перевыгрузится информация с текущими значениями, что уже не новинка.
		иначеЕсли Сайт.код =  "00007" Тогда
			ЗарегистроватьИзменениеПланаОбменаБ2б(текстр.номенклатура);  // перевыгрузится информация с текущими значениями, что уже не новинка.
		конецЕсли;	

	конецЦикла;	
	

КонецПроцедуры
// нечаева 15,11,2022---
//---------------------------------------------------------------------------

Процедура  Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	 ЗаписатьВЛог("Стильпарк","начало распродажа.",,,);

	СтрокаСоединенияСразрешеннымОбменом            =ВРег(СокрЛП(Константы.СтрокаСоединенияИБ_АвтоматическийОбмен.Получить()));
	ТекСтрокаСоединения                            =ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы()));
	
	//Кухарь А.Ю. 31.03.2026 начало
	// Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ТекСтрокаСоединения=СтрокаСоединенияСразрешеннымОбменом Тогда
	Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  И  ОбщегоНазначения_ПИ.ЭтоНеКопияАЖиваяБаза()  Тогда
		//Кухарь А.Ю. 31.03.2026 конец
		возврат;
	конецЕсли;   
	
	ПолучитьДокументРаспродажи();
	ПередачаИзмененийВчерашнегоДня();  // снимем прошлые галки
	//-----------------------------------------------
	// изменения на сегодня.
	//состояние("Запись изменений за сегодня");
	
	ПерезаписьРаспродажи();  // текущие данные заполним передадим.
	
	//----------------------------------------------------------------------------------------------------------
	// для новинок отдельно	 
	//
	ОбработкаНовинокПоСайтам();
	
	ОбработкаХитовПоСайтам();

	
	ЗаписатьВЛог("Стильпарк","Перезапись распродажи завершена.",,,);
	
конецПроцедуры


	
МассивУзлов = новый Массив;
Узел = планыОБмена.ОбменССайтомТоварами.НайтиПоКоду("RPR");
МассивУзлов.Добавить(Узел);

	
МассивУзловб2б = новый Массив;
Узел = планыОБмена.ОбменССайтомТоварами.НайтиПоКоду("B2B");
МассивУзловб2б.Добавить(Узел);
